zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg01/atdf/PIC32CK1025SG01144.atdf
          </instance>
          <instance name="CoreDebug_NS">
            <register-group name="CoreDebug_NS" name-in-module="CoreDebug" address-space="base" offset="0xE002EDF0"/>
          </instance>
        </module>
        <module name="DIB" id="SYSTEM_IP" version="1.0.0">
          <instance name="DIB">
            <register-group name="DIB" name-in-module="DIB" address-space="base" offset="0xE000EFB0"/>
          </instance>
          <instance name="DIB_NS">
            <register-group name="DIB_NS" name-in-module="DIB" address-space="base" offset="0xE002EFB0"/>
          </instance>
        </module>
        <module name="DMA" id="03639" name2="dma_axi_apb_v1" version="1b0">
          <instance name="DMA0">
            <register-group name="DMA0" name-in-module="DMA" address-space="base" offset="0x44802000"/>
            <parameters>
              <param name="DMAC_ID_EVSYS" value="1" caption="Events trigger index"/>
              <param name="DMAC_ID_SWTRG" value="0" caption="Software trigger index"/>
              <param name="INSTANCE_ID" value="33" caption="Instance index for DMA0"/>
              <param name="MCLK_ID_AHB" value="8" caption="Index for DMA0 AHB clock"/>
              <param name="MCLK_ID_APB" value="65" caption="Index for DMA0 APB clock"/>
              <param name="PAC_ID" value="33" caption="Index for DMA0 registers write protection"/>
            </parameters>
          </instance>
          <instance name="DMA1">
            <register-group name="DMA1" name-in-module="DMA" address-space="base" offset="0x44804000"/>
            <parameters>
              <param name="DMAC_ID_EVSYS" value="1" caption="Events trigger index"/>
              <param name="DMAC_ID_SWTRG" value="0" caption="Software trigger index"/>
              <param name="INSTANCE_ID" value="34" caption="Instance index for DMA1"/>
              <param name="MCLK_ID_AHB" value="9" caption="Index for DMA1 AHB clock"/>
              <param name="MCLK_ID_APB" value="66" caption="Index for DMA1 APB clock"/>
              <param name="PAC_ID" value="34" caption="Index for DMA1 registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="DSU" id="04850" name2="icd_dsu_u2810_v3" version="3a0">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x44000000"/>
            <parameters>
              <param name="BMX_ERROR_SUPPORT" value="0" caption="Defines whether DSU APB errors are reported as 2-cycles bus errors to the AHB AP0 master"/>
              <param name="DAL1_IMPLEMENTED" value="1" caption="Debug Access Level 1 (Non-Secure) Implemented? for TZ devices only"/>
              <param name="DMAC_ID_DCC0" value="2" caption="DMAC ID for DCC0 register"/>
              <param name="DMAC_ID_DCC1" value="3" caption="DMAC ID for DCC1 register"/>
              <param name="INSTANCE_ID" value="0" caption="Instance index for DSU"/>
              <param name="MCLK_ID_AHB" value="3" caption="Index for DSU AHB clock"/>
              <param name="MCLK_ID_APB" value="32" caption="Index for DSU APB clock"/>
              <param name="PAC_ID" value="0" caption="Index for DSU registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="DWT" id="SYSTEM_IP" version="1.0.0">
          <instance name="DWT">
            <register-group name="DWT" name-in-module="DWT" address-space="base" offset="0xE0001000"/>
            <parameters>
              <param name="__WPT_NUM" value="4" caption="Number of DWT watchpoint comparators"/>
            </parameters>
          </instance>
        </module>
        <module name="EBI" id="03591" name2="emb_hsmc3_v1" version="1a0">
          <instance name="EBI">
            <register-group name="EBI" name-in-module="EBI" address-space="base" offset="0x4502C000"/>
            <signals>
              <signal group="A" index="2" function="E" pad="PC19"/>
              <signal group="A" index="3" function="E" pad="PC18"/>
              <signal group="A" index="4" function="E" pad="PC17"/>
              <signal group="A" index="5" function="E" pad="PC16"/>
              <signal group="A" index="6" function="E" pad="PC15"/>
              <signal group="A" index="7" function="E" pad="PC05"/>
              <signal group="A" index="8" function="E" pad="PC14"/>
              <signal group="A" index="9" function="E" pad="PC04"/>
              <signal group="A" index="10" function="E" pad="PC03"/>
              <signal group="A" index="11" function="E" pad="PC02"/>
              <signal group="A" index="12" function="E" pad="PC01"/>
              <signal group="A" index="13" function="E" pad="PC00"/>
              <signal group="A" index="14" function="E" pad="PB10"/>
              <signal group="A" index="15" function="E" pad="PB09"/>
              <signal group="A" index="16" function="E" pad="PC27"/>
              <signal group="A" index="16" function="E" pad="PD08"/>
              <signal group="A" index="17" function="E" pad="PC26"/>
              <signal group="A" index="17" function="E" pad="PD07"/>
              <signal group="A" index="18" function="E" pad="PB25"/>
              <signal group="A" index="18" function="E" pad="PD06"/>
              <signal group="A" index="19" function="E" pad="PB24"/>
              <signal group="A" index="19" function="E" pad="PD02"/>
              <signal group="A" index="20" function="E" pad="PB23"/>
              <signal group="A" index="21" function="E" pad="PB22"/>
              <signal group="A" index="22" function="E" pad="PB21"/>
              <signal group="A" index="23" function="E" pad="PC28"/>
              <signal group="D" index="0" function="E" pad="PA13"/>
              <signal group="D" index="1" function="E" pad="PA14"/>
              <signal group="D" index="2" function="E" pad="PA15"/>
              <signal group="D" index="3" function="E" pad="PA16"/>
              <signal group="D" index="4" function="E" pad="PA17"/>
              <signal group="D" index="5" function="E" pad="PA04"/>
              <signal group="D" index="6" function="E" pad="PA05"/>
              <signal group="D" index="7" function="E" pad="PA06"/>
              <signal group="D" index="8" function="E" pad="PA07"/>
              <signal group="D" index="9" function="E" pad="PA08"/>
              <signal group="D" index="10" function="E" pad="PB11"/>
              <signal group="D" index="11" function="E" pad="PB12"/>
              <signal group="D" index="12" function="E" pad="PB05"/>
              <signal group="D" index="13" function="E" pad="PB13"/>
              <signal group="D" index="14" function="E" pad="PB06"/>
              <signal group="D" index="15" function="E" pad="PB14"/>
              <signal group="NBS0_A0" function="E" pad="PB08"/>
              <signal group="NBS1_NWR1" function="E" pad="PB07"/>
              <signal group="NBS2_NWR2_A1" function="E" pad="PC20"/>
              <signal group="NCS" index="0" function="E" pad="PC25"/>
              <signal group="NCS" index="0" function="E" pad="PD12"/>
              <signal group="NCS" index="1" function="E" pad="PC23"/>
              <signal group="NCS" index="1" function="E" pad="PD09"/>
              <signal group="NCS" index="2" function="E" pad="PC29"/>
              <signal group="NCS" index="3" function="E" pad="PD15"/>
              <signal group="NRD" function="E" pad="PB15"/>
              <signal group="NWAIT" function="E" pad="PA10"/>
              <signal group="NWAIT" function="E" pad="PC22"/>
              <signal group="NWAIT" function="E" pad="PD11"/>
              <signal group="NWE_NWR0" function="E" pad="PC24"/>
              <signal group="NWE_NWR0" function="E" pad="PD05"/>
            </signals>
            <parameters>
              <param name="ACTIVE_BS" value="0" caption="NBS signal polarity"/>
              <param name="ACTIVE_CS" value="0" caption="NCS signal polarity"/>
              <param name="ACTIVE_RD" value="0" caption="NRD signal polarity"/>
              <param name="ACTIVE_WR" value="0" caption="NWR signal polarity"/>
              <param name="DATA_PATH_NBR_XOR_LAYERS" value="2" caption="Number of XOR layers in datapath"/>
              <param name="DIFF_CHIP_ID" value="0x554E" caption="2 ASCII characters to differentiate chips (0x554E &lt;--&gt; &quot;UN&quot;)"/>
              <param name="EMC_DELAY_REGISTER" value="0" caption="Electro Magnetic Compatibility control registers embedded ?"/>
              <param name="EX_WAIT" value="0" caption="External Wait signal polarity"/>
              <param name="MEM_ADDR_SIZE" value="24" caption="Memory Interface size (aligned 32 bits)"/>
              <param name="NB_CS" value="4" caption="Number of Chip Select"/>
              <param name="NB_PAD_NOE" value="16" caption="Number of Pad Control"/>
              <param name="OCMS_INTERFACE" value="0" caption="Off Chip Memory Scrambling implemented ?"/>
              <param name="OVERLOADED" value="1" caption="Overloaded Mode implemented ?"/>
              <param name="INSTANCE_ID" value="86" caption="Instance index for EBI"/>
              <param name="MCLK_ID_AHB" value="21" caption="Index for EBI AHB clock"/>
              <param name="MCLK_ID_APB" value="114" caption="Index for EBI APB clock"/>
              <param name="PAC_ID" value="86" caption="Index for EBI registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="EIC" id="03706" name2="int_eic_u2804_v1" version="1b0">
          <instance name="EIC">
            <register-group name="EIC" name-in-module="EIC" address-space="base" offset="0x4401A000"/>
            <register-group name="EIC_SEC" name-in-module="EIC" address-space="base" offset="0x4401B000"/>
            <signals>
              <signal group="EXTINT" index="0" function="A" pad="PA16"/>
              <signal group="EXTINT" index="0" function="A" pad="PB00"/>
              <signal group="EXTINT" index="0" function="A" pad="PB16"/>
              <signal group="EXTINT" index="0" function="A" pad="PC00"/>
              <signal group="EXTINT" index="0" function="A" pad="PC16"/>
              <signal group="EXTINT" index="0" function="A" pad="PD00"/>
              <signal group="EXTINT" index="0" function="A" pad="PD16"/>
              <signal group="EXTINT" index="1" function="A" pad="PA01"/>
              <signal group="EXTINT" index="1" function="A" pad="PA17"/>
              <signal group="EXTINT" index="1" function="A" pad="PB01"/>
              <signal group="EXTINT" index="1" function="A" pad="PB17"/>
              <signal group="EXTINT" index="1" function="A" pad="PC01"/>
              <signal group="EXTINT" index="1" function="A" pad="PC17"/>
              <signal group="EXTINT" index="1" function="A" pad="PD01"/>
              <signal group="EXTINT" index="1" function="A" pad="PD17"/>
              <signal group="EXTINT" index="2" function="A" pad="PA02"/>
              <signal group="EXTINT" index="2" function="A" pad="PA18"/>
              <signal group="EXTINT" index="2" function="A" pad="PB02"/>
              <signal group="EXTINT" index="2" function="A" pad="PB18"/>
              <signal group="EXTINT" index="2" function="A" pad="PC02"/>
              <signal group="EXTINT" index="2" function="A" pad="PC18"/>
              <signal group="EXTINT" index="2" function="A" pad="PD18"/>
              <signal group="EXTINT" index="3" function="A" pad="PA03"/>
              <signal group="EXTINT" index="3" function="A" pad="PA19"/>
              <signal group="EXTINT" index="3" function="A" pad="PB03"/>
              <signal group="EXTINT" index="3" function="A" pad="PB19"/>
              <signal group="EXTINT" index="3" function="A" pad="PC03"/>
              <signal group="EXTINT" index="3" function="A" pad="PC19"/>
              <signal group="EXTINT" index="3" function="A" pad="PD03"/>
              <signal group="EXTINT" index="3" function="A" pad="PD19"/>
              <signal group="EXTINT" index="4" function="A" pad="PA04"/>
              <signal group="EXTINT" index="4" function="A" pad="PA20"/>
              <signal group="EXTINT" index="4" function="A" pad="PB04"/>
              <signal group="EXTINT" index="4" function="A" pad="PB20"/>
              <signal group="EXTINT" index="4" function="A" pad="PC04"/>
              <signal group="EXTINT" index="4" function="A" pad="PC20"/>
              <signal group="EXTINT" index="4" function="A" pad="PD04"/>
              <signal group="EXTINT" index="4" function="A" pad="PD20"/>
              <signal group="EXTINT" index="5" function="A" pad="PA05"/>
              <signal group="EXTINT" index="5" function="A" pad="PA21"/>
              <signal group="EXTINT" index="5" function="A" pad="PB05"/>
              <signal group="EXTINT" index="5" function="A" pad="PB21"/>
              <signal group="EXTINT" index="5" function="A" pad="PC05"/>
              <signal group="EXTINT" index="5" function="A" pad="PC21"/>
              <signal group="EXTINT" index="5" function="A" pad="PD05"/>
              <signal group="EXTINT" index="5" function="A" pad="PD21"/>
              <signal group="EXTINT" index="6" function="A" pad="PA06"/>
              <signal group="EXTINT" index="6" function="A" pad="PA22"/>
              <signal group="EXTINT" index="6" function="A" pad="PB06"/>
              <signal group="EXTINT" index="6" function="A" pad="PB22"/>
              <signal group="EXTINT" index="6" function="A" pad="PC06"/>
              <signal group="EXTINT" index="6" function="A" pad="PC22"/>
              <signal group="EXTINT" index="6" function="A" pad="PD06"/>
              <signal group="EXTINT" index="7" function="A" pad="PA07"/>
              <signal group="EXTINT" index="7" function="A" pad="PA23"/>
              <signal group="EXTINT" index="7" function="A" pad="PB07"/>
              <signal group="EXTINT" index="7" function="A" pad="PB23"/>
              <signal group="EXTINT" index="7" function="A" pad="PC07"/>
              <signal group="EXTINT" index="7" function="A" pad="PC23"/>
              <signal group="EXTINT" index="7" function="A" pad="PD07"/>
              <signal group="EXTINT" index="8" function="A" pad="PA08"/>
              <signal group="EXTINT" index="8" function="A" pad="PA24"/>
              <signal group="EXTINT" index="8" function="A" pad="PB08"/>
              <signal group="EXTINT" index="8" function="A" pad="PB24"/>
              <signal group="EXTINT" index="8" function="A" pad="PC24"/>
              <signal group="EXTINT" index="8" function="A" pad="PD08"/>
              <signal group="EXTINT" index="9" function="A" pad="PA09"/>
              <signal group="EXTINT" index="9" function="A" pad="PA25"/>
              <signal group="EXTINT" index="9" function="A" pad="PB09"/>
              <signal group="EXTINT" index="9" function="A" pad="PB25"/>
              <signal group="EXTINT" index="9" function="A" pad="PC09"/>
              <signal group="EXTINT" index="9" function="A" pad="PC25"/>
              <signal group="EXTINT" index="9" function="A" pad="PD09"/>
              <signal group="EXTINT" index="10" function="A" pad="PA10"/>
              <signal group="EXTINT" index="10" function="A" pad="PA26"/>
              <signal group="EXTINT" index="10" function="A" pad="PB10"/>
              <signal group="EXTINT" index="10" function="A" pad="PB26"/>
              <signal group="EXTINT" index="10" function="A" pad="PC10"/>
              <signal group="EXTINT" index="10" function="A" pad="PC26"/>
              <signal group="EXTINT" index="10" function="A" pad="PD10"/>
              <signal group="EXTINT" index="11" function="A" pad="PA11"/>
              <signal group="EXTINT" index="11" function="A" pad="PA27"/>
              <signal group="EXTINT" index="11" function="A" pad="PB11"/>
              <signal group="EXTINT" index="11" function="A" pad="PC11"/>
              <signal group="EXTINT" index="11" function="A" pad="PC27"/>
              <signal group="EXTINT" index="11" function="A" pad="PD11"/>
              <signal group="EXTINT" index="12" function="A" pad="PA12"/>
              <signal group="EXTINT" index="12" function="A" pad="PA28"/>
              <signal group="EXTINT" index="12" function="A" pad="PB12"/>
              <signal group="EXTINT" index="12" function="A" pad="PC12"/>
              <signal group="EXTINT" index="12" function="A" pad="PC28"/>
              <signal group="EXTINT" index="12" function="A" pad="PD12"/>
              <signal group="EXTINT" index="13" function="A" pad="PA13"/>
              <signal group="EXTINT" index="13" function="A" pad="PB13"/>
              <signal group="EXTINT" index="13" function="A" pad="PC13"/>
              <signal group="EXTINT" index="13" function="A" pad="PC29"/>
              <signal group="EXTINT" index="13" function="A" pad="PD13"/>
              <signal group="EXTINT" index="14" function="A" pad="PA00"/>
              <signal group="EXTINT" index="14" function="A" pad="PB14"/>
              <signal group="EXTINT" index="14" function="A" pad="PC14"/>
              <signal group="EXTINT" index="14" function="A" pad="PD14"/>
              <signal group="EXTINT" index="14" function="A" pad="PA14"/>
              <signal group="EXTINT" index="15" function="A" pad="PA15"/>
              <signal group="EXTINT" index="15" function="A" pad="PB15"/>
              <signal group="EXTINT" index="15" function="A" pad="PC15"/>
              <signal group="EXTINT" index="15" function="A" pad="PD15"/>
              <signal group="NMI" function="A" pad="PD02"/>
            </signals>
            <parameters>
              <param name="EXTINT_NUM" value="16" caption="Number of external interrupts"/>
              <param name="GCLK_ID" value="5" caption="Generic Clock index"/>
              <param name="NUMBER_OF_CONFIG_REGS" value="2" caption="Number of CONFIG registers"/>
              <param name="NUMBER_OF_INTERRUPTS" value="16" caption="Number of external interrupts (obsolete)"/>
              <param name="SECURE_IMPLEMENTED" value="1" caption="Security Configuration implemented?"/>
              <param name="INSTANCE_ID" value="13" caption="Instance index for EIC"/>
              <param name="MCLK_ID_APB" value="45" caption="Index for EIC APB clock"/>
              <param name="PAC_ID" value="13" caption="Index for EIC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="ETH" id="03792" name2="eth_gem_apb_v1" version="1b0">
          <instance name="ETH">
            <register-group name="ETH" name-in-module="ETH" address-space="base" offset="0x45022000"/>
            <signals>
              <signal group="COL" function="L" pad="PC18"/>
              <signal group="CRS" function="L" pad="PC17"/>
              <signal group="MDC" function="L" pad="PA11"/>
              <signal group="MDC" function="L" pad="PB10"/>
              <signal group="MDC" function="L" pad="PC03"/>
              <signal group="MDC" function="L" pad="PD07"/>
              <signal group="MDIO" function="L" pad="PA12"/>
              <signal group="MDIO" function="L" pad="PC02"/>
              <signal group="MDIO" function="L" pad="PC04"/>
              <signal group="MDIO" function="L" pad="PC21"/>
              <signal group="MDIO" function="L" pad="PD06"/>
              <signal group="REF_CLK" function="L" pad="PC00"/>
              <signal group="RXD" index="0" function="L" pad="PC07"/>
              <signal group="RXD" index="1" function="L" pad="PC06"/>
              <signal group="RXD" index="2" function="L" pad="PC05"/>
              <signal group="RXD" index="3" function="L" pad="PC14"/>
              <signal group="RXDV" function="L" pad="PC10"/>
              <signal group="RXER" function="L" pad="PC09"/>
              <signal group="RX_CLK" function="L" pad="PC15"/>
              <signal group="TSUCOMP" function="L" pad="PD02"/>
              <signal group="TSUCOMP" function="L" pad="PD16"/>
              <signal group="TXD" index="0" function="L" pad="PC12"/>
              <signal group="TXD" index="1" function="L" pad="PC13"/>
              <signal group="TXD" index="2" function="L" pad="PC19"/>
              <signal group="TXD" index="3" function="L" pad="PC20"/>
              <signal group="TXEN" function="L" pad="PC11"/>
              <signal group="TXER" function="L" pad="PC16"/>
              <signal group="TX_CLK" function="L" pad="PC00"/>
            </signals>
            <parameters>
              <param name="GCLK_ID_TSU" value="42" caption="1588 External Clock"/>
              <param name="GCLK_ID_TX" value="41" caption="GIGE/Loopback clock"/>
              <param name="MEM_MARGINADJ_MSB" value="9" caption="Number of Memory Margin Adjust bits"/>
              <param name="NUM_INT" value="1" caption="Number of Interrupts"/>
              <param name="INSTANCE_ID" value="81" caption="Instance index for ETH"/>
              <param name="MCLK_ID_AHB" value="15" caption="Index for ETH AHB clock"/>
              <param name="MCLK_ID_APB" value="111" caption="Index for ETH APB clock"/>
              <param name="PAC_ID" value="81" caption="Index for ETH registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="EVSYS" id="03601" name2="ptg_evsys_u2504_v2" version="2b0">
          <instance name="EVSYS">
            <register-group name="EVSYS" name-in-module="EVSYS" address-space="base" offset="0x4480E000"/>
