zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg01/atdf/PIC32CK1025SG01144.atdf
            <parameters>
              <param name="ASYNCHRONOUS_CHANNELS" value="0xFFFFF000" caption="Mask of Only Asynchronous Channels"/>
              <param name="CHANNELS" value="32" caption="Total Number of Channels"/>
              <param name="CHANNELS_BITS" value="5" caption="Number of bits to select Channel"/>
              <param name="GCLK_ID_0" value="6" caption="Index of Generic Clocks for Synchronous Channels 0"/>
              <param name="GCLK_ID_1" value="7" caption="Index of Generic Clocks for Synchronous Channels 1"/>
              <param name="GCLK_ID_2" value="8" caption="Index of Generic Clocks for Synchronous Channels 2"/>
              <param name="GCLK_ID_3" value="9" caption="Index of Generic Clocks for Synchronous Channels 3"/>
              <param name="GCLK_ID_4" value="10" caption="Index of Generic Clocks for Synchronous Channels 4"/>
              <param name="GCLK_ID_5" value="11" caption="Index of Generic Clocks for Synchronous Channels 5"/>
              <param name="GCLK_ID_6" value="12" caption="Index of Generic Clocks for Synchronous Channels 6"/>
              <param name="GCLK_ID_7" value="13" caption="Index of Generic Clocks for Synchronous Channels 7"/>
              <param name="GCLK_ID_8" value="14" caption="Index of Generic Clocks for Synchronous Channels 8"/>
              <param name="GCLK_ID_9" value="15" caption="Index of Generic Clocks for Synchronous Channels 9"/>
              <param name="GCLK_ID_10" value="16" caption="Index of Generic Clocks for Synchronous Channels 10"/>
              <param name="GCLK_ID_11" value="17" caption="Index of Generic Clocks for Synchronous Channels 11"/>
              <param name="GENERATORS" value="125" caption="Total Number of Event Generators"/>
              <param name="GENERATORS_BITS" value="7" caption="Number of bits to select Event Generator"/>
              <param name="SECURE_IMPLEMENTED" value="0" caption="Security Configuration implemented?"/>
              <param name="SPLIT_IRQ_NUM" value="4" caption="Number of channels with dedicated interrupt line request"/>
              <param name="SYNCH_NUM" value="12" caption="Number of Synchronous Channels"/>
              <param name="SYNCH_NUM_BITS" value="4" caption="Number of bits to select Synchronous Channels"/>
              <param name="USERS" value="104" caption="Total Number of Event Users"/>
              <param name="USERS_BITS" value="7" caption="Number of bits to select Event User"/>
              <param name="USERS_GROUPS" value="4" caption="Number of 32-user Groups"/>
              <param name="INSTANCE_ID" value="39" caption="Instance index for EVSYS"/>
              <param name="MCLK_ID_APB" value="70" caption="Index for EVSYS APB clock"/>
              <param name="PAC_ID" value="39" caption="Index for EVSYS registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="FCR" id="03438" name2="pfm_ctrlr_apb_v1" version="1b0">
          <instance name="FCR">
            <register-group name="FCR" name-in-module="FCR" address-space="base" offset="0x44002000"/>
            <parameters>
              <param name="INSTANCE_ID" value="1" caption="Instance index for FCR"/>
              <param name="MCLK_ID_AHB" value="4" caption="Index for FCR AHB clock"/>
              <param name="MCLK_ID_APB" value="33" caption="Index for FCR APB clock"/>
              <param name="PAC_ID" value="1" caption="Index for FCR registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="FCW" id="03433" name2="pfm_ctrlw_apb_v1" version="1b0">
          <instance name="FCW">
            <register-group name="FCW" name-in-module="FCW" address-space="base" offset="0x44004000"/>
            <parameters>
              <param name="PFM_NUM_PAGES" value="256" caption="No of PFM Pages Per panel"/>
              <param name="PFM_PAGE_ADDR_MSB" value="11" caption="Flash Page Size MSB"/>
              <param name="PFM_PAGE_SIZE" value="4096" caption="PFM page size"/>
              <param name="PFM_PNL_ADDR_MSB" value="21" caption="Single flash panel read address MSbit (using byte addressing)"/>
              <param name="PFM_SIZE" value="8" caption="Flash Memory Parameters"/>
              <param name="PFM_SYS_ADDR_MSB" value="20" caption="The MS bit of the system byte address needed to address the entire PFM region (both panels Main)"/>
              <param name="FLASH_SIZE" value="1048576"/>
              <param name="PAGES" value="256"/>
              <param name="PAGES_PR_REGION" value="16"/>
              <param name="INSTANCE_ID" value="2" caption="Instance index for FCW"/>
              <param name="MCLK_ID_AHB" value="5" caption="Index for FCW AHB clock"/>
              <param name="MCLK_ID_APB" value="34" caption="Index for FCW APB clock"/>
              <param name="PAC_ID" value="2" caption="Index for FCW registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="FPB" id="SYSTEM_IP" version="1.0.0">
          <instance name="FPB">
            <register-group name="FPB" name-in-module="FPB" address-space="base" offset="0xE0002000"/>
            <parameters>
              <param name="__BKPT_NUM" value="8" caption="Number of FPB breakpoint comparators"/>
            </parameters>
          </instance>
        </module>
        <module name="FPU" id="SYSTEM_IP" version="1.0.0">
          <instance name="FPU">
            <register-group name="FPU" name-in-module="FPU" address-space="base" offset="0xE000EF30"/>
          </instance>
          <instance name="FPU_NS">
            <register-group name="FPU_NS" name-in-module="FPU" address-space="base" offset="0xE002EF30"/>
            <parameters>
              <param name="TYPE" value="8" caption="FPU architecture type"/>
            </parameters>
          </instance>
        </module>
        <module name="FREQM" id="03707" name2="clk_freqm_u2257_v3" version="3a0">
          <instance name="FREQM">
            <register-group name="FREQM" name-in-module="FREQM" address-space="base" offset="0x44014000"/>
            <parameters>
              <param name="GCLK_ID_MSR_0" value="2" caption="Index of measure generic clock 0"/>
              <param name="GCLK_ID_MSR_1" value="3" caption="Index of measure generic clock 1"/>
              <param name="GCLK_ID_REF" value="4" caption="Index of reference generic clock"/>
              <param name="MSRCLK_NB" value="2" caption="Number of measured clock sources"/>
              <param name="INSTANCE_ID" value="10" caption="Instance index for FREQM"/>
              <param name="MCLK_ID_APB" value="42" caption="Index for FREQM APB clock"/>
              <param name="PAC_ID" value="10" caption="Index for FREQM registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="fuses" name2="fuses" version="1a0">
          <instance name="FUSES">
            <register-group name="FUSES_BOOTCFG1" name-in-module="FUSES_BOOTCFG1" address-space="base" offset="0x0A002000"/>
            <register-group name="FUSES_BOOTCFG2" name-in-module="FUSES_BOOTCFG1" address-space="base" offset="0x0A00A000"/>
