zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg01/atdf/PIC32CK1025SG01144.atdf
      <value-group name="DAUTHSTATUS__NSUID">
        <value name="NOSEC" caption="Unprivileged halting debug not implemented" value="0"/>
        <value name="NO" caption="Non-secure halting debug prohibited" value="2"/>
        <value name="YES" caption="Non-secure halting debug allowed in unprivileged mode" value="3"/>
      </value-group>
      <value-group name="DAUTHSTATUS__NSUNID">
        <value name="NOSEC" caption="Unprivileged Non-invasive debug not implemented" value="0"/>
        <value name="NO" caption="Non-secure Non-invasive debug prohibited" value="2"/>
        <value name="YES" caption="Non-secure Non-invasive debug allowed in unprivileged mode" value="3"/>
      </value-group>
      <value-group name="DAUTHSTATUS__SUID">
        <value name="NOSEC" caption="Security Extension or Unprivileged Debug not implemented" value="0"/>
        <value name="NO" caption="Secure halting debug prohibited" value="2"/>
        <value name="YES" caption="Secure halting debug allowed in unprivileged mode" value="3"/>
      </value-group>
      <value-group name="DAUTHSTATUS__SUNID">
        <value name="NOSEC" caption="Security Extension or Unprivileged Non-invasive Debug not implemented" value="0"/>
        <value name="NO" caption="Secure Non-invasive debug prohibited" value="2"/>
        <value name="YES" caption="Secure Non-invasive debug allowed in unprivileged mode" value="3"/>
      </value-group>
    </module>
    <module name="DMA" id="03639" name2="dma_axi_apb_v1" version="1b0" caption="Direct Memory Access Controller">
      <register-group name="CHANNEL" size="0x50">
        <register name="CHCTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="CHANNEL CONTROL REGISTER A">
          <bitfield name="ENABLE" caption="Channel Enable" mask="0x1"/>
          <bitfield name="LLEN" caption="Linked List Enable" mask="0x100"/>
          <bitfield name="SWFRC" caption="Software Forced Trigger" mask="0x10000"/>
          <bitfield name="RUNSTDBY" caption="Run In Standby" mask="0x1000000"/>
        </register>
        <register name="CHCTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="CHANNEL CONTROL REGISTER B">
          <bitfield name="WAS" caption="Channel Write Address Sequence." mask="0x7" values="CHCTRLB__WAS"/>
          <bitfield name="RAS" caption="Channel Read Address Sequence" mask="0x70" values="CHCTRLB__RAS"/>
          <bitfield name="PRI" caption="Channel Priority level." mask="0x300" values="CHCTRLB__PRI"/>
          <bitfield name="WBOEN" caption="Write Byte Order Enable" mask="0x2000"/>
          <bitfield name="BYTORD" caption="Byte Order" mask="0xC000" values="CHCTRLB__BYTORD"/>
          <bitfield name="TRIG" caption="Trigger that can Start a Channel Transfer" mask="0xFF0000"/>
          <bitfield name="PIGNEN" caption="Enable Pattern Ignore Byte" mask="0x1000000"/>
          <bitfield name="PATLEN" caption="Pattern Match Length" mask="0x2000000"/>
          <bitfield name="PATEN" caption="Channel Pattern Match Abort Enable." mask="0x4000000"/>
          <bitfield name="CASTEN" caption="Cell Auto Start Enable of Ensuing Transfers for this channel" mask="0x20000000"/>
          <bitfield name="CRCEN" caption="CRC Enable bit" mask="0x80000000"/>
        </register>
        <register name="CHEVCTRL" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="CHANNEL EVENT CONTROL REGISTER">
          <bitfield name="EVAUXACT" caption="Channel Auxiliary Event Input Action" mask="0x3" values="CHEVCTRL__EVAUXACT"/>
          <bitfield name="EVOMODE" caption="Channel Event Output Mode" mask="0xC" values="CHEVCTRL__EVOMODE"/>
          <bitfield name="EVAUXIE" caption="Channel Auxiliary Event Enable (0: disable; 1: enable)" mask="0x20"/>
          <bitfield name="EVSTRIE" caption="Channel Start Event Input Enable (0: disable; 1:enable)" mask="0x40"/>
          <bitfield name="EVOE" caption="Channel Event Output Enable (0: disable; 1: enable)" mask="0x80"/>
        </register>
        <register name="CHINTENCLR" offset="0xC" rw="RW" size="4" atomic-op="clear:CHINTENCLR" initval="0x00000000" caption="CHANNEL INTERRUPT ENABLE CLEAR REGISTER">
          <bitfield name="SD" caption="Channel Event Output Enable" mask="0x1"/>
          <bitfield name="TA" caption="Clear Transfer Abort Interrupt Enable" mask="0x2"/>
          <bitfield name="CC" caption="Clear Cell Transfer Complete Interrupt Enable" mask="0x4"/>
          <bitfield name="BC" caption="Clear Cell Transfer Complete Interrupt Enable" mask="0x8"/>
          <bitfield name="BH" caption="Clear Block Transfer Half Complete Interrupt Enable" mask="0x10"/>
          <bitfield name="LL" caption="Clear Linked List Done Interrupt Enable" mask="0x20"/>
        </register>
        <register name="CHINTENSET" offset="0x10" rw="RW" size="4" atomic-op="set:CHINTENSET" initval="0x00000000" caption="CHANNEL INTERRUPT ENABLE SET REGISTER">
          <bitfield name="SD" caption="Channel Event Output Enable" mask="0x1"/>
          <bitfield name="TA" caption="Set Transfer Abort Interrupt Enable" mask="0x2"/>
          <bitfield name="CC" caption="set Cell Transfer Complete Interrupt Enable" mask="0x4"/>
          <bitfield name="BC" caption="set Cell Transfer Complete Interrupt Enable" mask="0x8"/>
          <bitfield name="BH" caption="set Block Transfer Half Complete Interrupt Enable" mask="0x10"/>
          <bitfield name="LL" caption="set Linked List Done Interrupt Enable" mask="0x20"/>
        </register>
        <register name="CHINTF" offset="0x14" rw="RW" size="4" atomic-op="clear:CHINTF" initval="0x00000000" caption="CHANNEL INTERRUPT FLAG REGISTER">
          <bitfield name="SD" caption="Start Detected Interrupt Flag (0: none ; 1: Start Detected)" mask="0x1"/>
          <bitfield name="TA" caption="Transfer Abort Interrupt Flag (0: none; 1: Transfer Aborted)" mask="0x2"/>
          <bitfield name="CC" caption="Cell Transfer Complete Interrupt Flag (0: none ; 1: complete)" mask="0x4"/>
          <bitfield name="BC" caption="Block Transfer Complete Interrupt Flag (0: none; 1:complete;)" mask="0x8"/>
          <bitfield name="BH" caption="Block Transfer Half Complete Interrupt Flag (0: none; 1: half complete)" mask="0x10"/>
          <bitfield name="LL" caption="Linked List Done Interrupt Flag (0: none; 1: done)" mask="0x20"/>
          <bitfield name="WRE" caption="Write Error Flag (0: none; 1: Write Error)" mask="0x20000"/>
          <bitfield name="RDE" caption="Read Error Flag (0: none; 1: Read Error)" mask="0x40000"/>
        </register>
        <register name="CHSSA" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="CHANNEL SOURCE START ADDRESS">
          <bitfield name="SSA" caption="Channel Source Start Address" mask="0xFFFFFFFF"/>
        </register>
