zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg01/atdf/PIC32CK1025SG01144.atdf
        <register name="FUCFG10" offset="0x68" rw="RW" size="4" access-size="4" caption="User Configuration 10 (Peripheral Bus A security attribution">
          <bitfield name="NONSECA_PM" caption="BOOTROM NONSEC A Power Manager secure/non-secure" mask="0x8"/>
          <bitfield name="NONSECA_SUPC" caption="BOOTROM NONSEC A Supply Controller secure/non-secure" mask="0x10"/>
          <bitfield name="NONSECA_RSTC" caption="BOOTROM NONSEC A Reset Controller secure/non-secure" mask="0x20"/>
          <bitfield name="NONSECA_OSCCTRL" caption="BOOTROM NONSEC A Oscillator Control secure/non-secure" mask="0x40"/>
          <bitfield name="NONSECA_OSC32KCTRL" caption="BOOTROM NONSEC A 32k Oscillator Control secure/non-secure" mask="0x80"/>
          <bitfield name="NONSECA_GCLK" caption="BOOTROM NONSEC A Generic Clock secure/non-secure" mask="0x100"/>
          <bitfield name="NONSECA_MCLK" caption="BOOTROM NONSEC A Main Clock secure/non-secure" mask="0x200"/>
          <bitfield name="NONSECA_FREQM" caption="BOOTROM NONSEC A Frequency Meter secure/non-secure" mask="0x400"/>
          <bitfield name="NONSECA_WDT" caption="BOOTROM NONSEC A Watchdog Timer secure/non-secure" mask="0x800"/>
          <bitfield name="NONSECA_RTC" caption="BOOTROM NONSEC A Real Time Clock secure/non-secure" mask="0x1000"/>
          <bitfield name="NONSECA_EIC" caption="BOOTROM NONSEC A External Interrupt Controller secure/non-secure" mask="0x2000"/>
          <bitfield name="NONSECA_PAC" caption="BOOTROM NONSEC A Peripheral Access Controller secure/non-secure" mask="0x4000"/>
        </register>
        <register name="FUCFG11" offset="0x6C" rw="RW" size="4" access-size="4" caption="User Configuration 11 (Peripheral Bus B security attribution">
          <bitfield name="NONSECB_PORT" caption="BOOTROM NONSEC B PORT secure/non-secure" mask="0x1"/>
          <bitfield name="NONSECB_DMA0" caption="BOOTROM NONSEC B DMA0 secure/non-secure" mask="0x2"/>
          <bitfield name="NONSECB_DMA1" caption="BOOTROM NONSEC B DMA1 secure/non-secure" mask="0x4"/>
          <bitfield name="NONSECB_HMATRIX" caption="BOOTROM NONSEC B HMATRIX secure/non-secure" mask="0x8"/>
          <bitfield name="NONSECB_CMCC" caption="BOOTROM NONSEC B Cortex M Cache Controller secure/non-secure" mask="0x10"/>
          <bitfield name="NONSECB_PRM" caption="BOOTROM NONSEC B Boot ROM secure/non-secure" mask="0x20"/>
          <bitfield name="NONSECB_EVSYS" caption="BOOTROM NONSEC B Event System secure/non-secure" mask="0x80"/>
          <bitfield name="NONSECB_SERCOM0" caption="BOOTROM NONSEC B SERCOM0 secure/non-secure" mask="0x100"/>
          <bitfield name="NONSECB_SERCOM1" caption="BOOTROM NONSEC B SERCOM1 secure/non-secure" mask="0x200"/>
          <bitfield name="NONSECB_SERCOM2" caption="BOOTROM NONSEC B SERCOM2 secure/non-secure" mask="0x400"/>
          <bitfield name="NONSECB_SERCOM3" caption="BOOTROM NONSEC B SERCOM3 secure/non-secure" mask="0x800"/>
          <bitfield name="NONSECB_TCC0" caption="BOOTROM NONSEC B TCC0 secure/non-secure" mask="0x1000"/>
          <bitfield name="NONSECB_TCC1" caption="BOOTROM NONSEC B TCC1 secure/non-secure" mask="0x2000"/>
          <bitfield name="NONSECB_TCC2" caption="BOOTROM NONSEC B TCC2 secure/non-secure" mask="0x4000"/>
          <bitfield name="NONSECB_TCC3" caption="BOOTROM NONSEC B TCC3 secure/non-secure" mask="0x8000"/>
        </register>
        <register name="FUCFG12" offset="0x70" rw="RW" size="4" access-size="4" caption="User Configuration 12 (Peripheral Bus C security attribution">
          <bitfield name="NONSECC_SERCOM4" caption="BOOTROM NONSEC C SERCOM4 secure/non-secure" mask="0x1"/>
          <bitfield name="NONSECC_SERCOM5" caption="BOOTROM NONSEC C SERCOM5 secure/non-secure" mask="0x2"/>
          <bitfield name="NONSECC_SERCOM6" caption="BOOTROM NONSEC C SERCOM6 secure/non-secure" mask="0x4"/>
          <bitfield name="NONSECC_SERCOM7" caption="BOOTROM NONSEC C SERCOM7 secure/non-secure" mask="0x8"/>
          <bitfield name="NONSECC_TCC4" caption="BOOTROM NONSEC C TCC4 secure/non-secure" mask="0x10"/>
          <bitfield name="NONSECC_TCC5" caption="BOOTROM NONSEC C TCC5 secure/non-secure" mask="0x20"/>
          <bitfield name="NONSECC_TCC6" caption="BOOTROM NONSEC C TCC6 secure/non-secure" mask="0x40"/>
          <bitfield name="NONSECC_TCC7" caption="BOOTROM NONSEC C TCC7 secure/non-secure" mask="0x80"/>
          <bitfield name="NONSECC_ADC" caption="BOOTROM NONSEC C ADC secure/non-secure" mask="0x100"/>
          <bitfield name="NONSECC_AC" caption="BOOTROM NONSEC C Analog Comparator secure/non-secure" mask="0x200"/>
          <bitfield name="NONSECC_PTC" caption="BOOTROM NONSEC C PTC secure/non-secure" mask="0x400"/>
          <bitfield name="NONSECC_SPI_IXS" caption="BOOTROM NONSEC C SPI_IXS secure/non-secure" mask="0x800"/>
          <bitfield name="NONSECC_PCC" caption="BOOTROM NONSEC C PCC secure/non-secure" mask="0x1000"/>
          <bitfield name="NONSECC_CCL" caption="BOOTROM NONSEC C CCL secure/non-secure" mask="0x2000"/>
          <bitfield name="NONSECC_PDEC" caption="BOOTROM NONSEC C PDEC secure/non-secure" mask="0x4000"/>
          <bitfield name="NONSECC_CAN0" caption="BOOTROM NONSEC C CAN0 secure/non-secure" mask="0x8000"/>
          <bitfield name="NONSECC_CAN1" caption="BOOTROM NONSEC C CAN1 secure/non-secure" mask="0x10000"/>
          <bitfield name="NONSECC_ETH" caption="BOOTROM NONSEC C ETH secure/non-secure" mask="0x20000"/>
          <bitfield name="NONSECC_TRNG" caption="BOOTROM NONSEC C TRNG secure/non-secure" mask="0x40000"/>
          <bitfield name="NONSECC_SDMMC0" caption="BOOTROM NONSEC C SDMMC0 secure/non-secure" mask="0x80000"/>
          <bitfield name="NONSECC_SDMMC1" caption="BOOTROM NONSEC C SDMMC1 secure/non-secure" mask="0x100000"/>
          <bitfield name="NONSECC_USB" caption="BOOTROM NONSEC C Full Speed USB secure/non-secure" mask="0x200000"/>
          <bitfield name="NONSECC_EBI" caption="BOOTROM NONSEC C EBI secure/non-secure" mask="0x400000"/>
        </register>
        <register name="FUCFG13" offset="0x74" rw="RW" size="4" access-size="4" caption="User Configuration 13 (AHB peripheral security attribution">
          <bitfield name="NONSEC_AHB_SQI" caption="BOOTROM NONSEC AHB SQI secure/non-secure" mask="0x1"/>
          <bitfield name="NONSEC_AHB_USBHS" caption="BOOTROM NONSEC AHB USB High Speed secure/non-secure" mask="0x2"/>
          <bitfield name="NONSEC_AHB_HSM" caption="BOOTROM NONSEC AHB HSM secure/non-secure" mask="0x4"/>
        </register>
